# Copyright 2025 KU Leuven.
# Licensed under the Apache License, Version 2.0, see LICENSE for details.
# SPDX-License-Identifier: Apache-2.0

# Author: Giuseppe Sarda <giuseppe.sarda@esat.kuleuven.be>

# Synthesis script inspired from
#   https://github.com/rgantonio/digiforge/blob/main/synthoria/syn/dc_syn/dc_syn.tcl

#-----------------------------
# 0.a Setup steps
#-----------------------------

# This sets the max number of cores to be used
set_host_options -max_cores 16

# Need to enable these variables
# To ensure that the cores run in parallel
set disable_multicore_resource_checks true
set dcnxt_adaptive_multithreading true

# Set other synthesis settings
# Preserve FF with not load used as spare"
set hdlin_preserve_sequential ff+loop_variables

# Set the naming rules for the design
# Add any additional Design Compiler variables needed here
define_name_rules verilog \
    -target_bus_naming_style "%s\[%d\]" \
    -first_restricted "0-9_" \
    -replacement_char "_" \
    -equal_ports_nets -inout_ports_equal_nets \
    -collapse_name_space -case_insensitive -special verilog \
    -add_dummy_nets \
    -dummy_net_prefix "synp_unconn_%d" \
    -preserve_struct_ports

#-----------------------------
# 0.b Paths
#-----------------------------
source ./common/utils.tcl
source ./config.tcl

set workdir_path ${WORK_DIR}
set output_path "./output/${SYN_TLE}-${TECH_NODE}-${RUN_ID}"
file mkdir $output_path

set log_path "$output_path/logs"
file mkdir $log_path
set log_file "$log_path/${RUN_ID}_synthesis.log"

set report_path "$output_path/reports"
file mkdir $report_path

set flist_path ${FILE_LIST}
set sdc_constraints_path ${SDC_CONSTRAINTS}

#-----------------------------
# 1 Technology setup
#-----------------------------

source tech/${TECH_NODE}/${TECH_NODE}-setup.tcl

#-----------------------------

define_design_lib WORK -path $workdir_path
set search_path "$search_path $log_path $output_path $sdc_constraints_path ./"

#-----------------------------
# 2. Sourcing the design
#-----------------------------

# Sourcing your filelist (generated by bender)
source $flist_path

# Elaborate to check and see the synthesizability of the design
# Also check for latches at this point
elaborate $SYN_TLE

# Apply the defined named rules to the design
change_names -rules verilog -hierarchy

# Set the top module of your design
current_design $SYN_TLE

# Link the elaborated design to the libraries
link

# Do a check of the design  (e.g., unconnected ports, logic loops, etc.)
check_design > $log_path/check_design.log

#---------------------------------
# 3. Read the timing constraints
#---------------------------------

source $sdc_constraints_path

# Prioritize delay
set_cost_priority -delay

# Buffer constants to reduce density
set_fix_multiple_port_nets -all -buffer_constants

#------------------------------------
# 4. Set special rules for the design
#------------------------------------

source ./inputs/lagd-special-rules.tcl

#------------------------------------
# 5. Compile the design
#------------------------------------

compile_ultra -retime

#-----------------------------
# 6. Report generation
#-----------------------------

report_qor -significant_digits 5 > $report_path/qor.rpt

# Reporting all the timing violations
report_constraint -all_violators -nosplit -verbose -significant_digits 5 -max_delay \
    > $report_path/constraint_report_setup.rpt
# report_constraint -all_violators -nosplit -verbose -significant_digits 5 -min_delay \
    > $report_path/constraint_report_hold.rpt

# Reporting area of the design
report_area > $report_path/area_report.rpt
report_area -hierarchy -nosplit > $report_path/area_hierarchy.rpt

# Reporting the power of the design
report_power > $report_path/power_report.rpt
report_power -hierarchy > $report_path/power_report_hierarchy.rpt
report_power -verbose > $report_path/power_report_verbose.rpt
report_power -verbose -hierarchy > $report_path/power_report_verbose_hierarchy.rpt

#-----------------------------
# 8. Write the final design
#-----------------------------

# Write the netlist
write_file -format verilog -hierarchy -output $output_path/${SYN_TLE}-${TECH_NODE}-netlist.v

# Write the database
write_file -format ddc -hierarchy -output $output_path/${SYN_TLE}-${TECH_NODE}.ddc

# Write the delay annotations
write_sdf $output_path/${SYN_TLE}-${TECH_NODE}.sdf

# Save the final design constraints
write_sdc $output_path/${SYN_TLE}-${TECH_NODE}.sdc

#-----------------------------
# Finish
#-----------------------------
quit